README.org
#+title: Kubernetes the hard way (on cheap Raspberry Pi cluster)

* Notes
Based on: [[https://github.com/kelseyhightower/kubernetes-the-hard-way][Kubernetes The Hard Way by kelseyhightower]]
Changes
- Remove kube-proxy, use Cillium instead

Other references
- [[https://unix.stackexchange.com/questions/471476/how-do-i-check-cgroup-v2-is-installed-on-my-machine][Check ~cgroup~ version]]

* Initial hardware setup
- 01 x server node: Orange Pi Zero 3
  - server: 4 CPU 2 GiB memory
- 02 x worker node: Raspberry Pi 4B
  - node-0: 4 CPU 8GiB memory
  - node-1: 4 CPU 4GiB memory

* Outline
- Download binaries to
  - downloads
    - arm64
    - amd64
- Use symlink to setup for each node
* Download and extract binaries
Download
#+begin_src sh
  for ARCH in arm64 amd64;
  do
      mkdir -p downloads/${ARCH}
      wget -q --show-progress \
           --https-only \
           --timestamping \
           -P downloads/${ARCH} \
           -i downloads.${ARCH}.txt
  done
#+end_src
Extract, put into places and make executable
#+begin_src sh
  for ARCH in amd64 arm64;
  do
      mkdir -p downloads/${ARCH}/{client,cni-plugins,controller,worker}
      tar -xvf downloads/${ARCH}/crictl-v1.33.0-linux-${ARCH}.tar.gz \
          -C downloads/${ARCH}/worker/
      tar -xvf downloads/${ARCH}/containerd-2.1.0-rc.0-linux-${ARCH}.tar.gz \
          --strip-components 1 \
          -C downloads/${ARCH}/worker/
      tar -xvf downloads/${ARCH}/cni-plugins-linux-${ARCH}-v1.7.1.tgz \
          -C downloads/${ARCH}/cni-plugins/
      tar -xvf downloads/${ARCH}/etcd-v3.6.0-rc.4-linux-${ARCH}.tar.gz \
          -C downloads/${ARCH}/ \
          --strip-components 1 \
          etcd-v3.6.0-rc.4-linux-${ARCH}/etcdctl \
          etcd-v3.6.0-rc.4-linux-${ARCH}/etcd
      mv downloads/${ARCH}/{etcdctl,kubectl} downloads/${ARCH}/client/
      mv downloads/${ARCH}/{etcd,kube-apiserver,kube-controller-manager,kube-scheduler} \
         downloads/${ARCH}/controller/
      mv downloads/${ARCH}/kubelet downloads/${ARCH}/worker/
      mv downloads/${ARCH}/runc.${ARCH} downloads/${ARCH}/worker/runc
      chmod +x downloads/${ARCH}/worker/{kubelet,runc}
      chmod +x downloads/${ARCH}/client/kubectl
      chmod +x downloads/${ARCH}/controller/kube-{apiserver,controller-manager,scheduler}
  done
#+end_src

* Organize to-be-used computer resources
Setup SSH, hostname
#+begin_src sh
  cp machines.txt{.template,}
  # example
  # 192.168.68.106 server.kubernetes.local server
  # 192.168.68.111 node-0.kubernetes.local node-0 10.200.0.0/24
  # 192.168.68.112 node-1.kubernetes.local node-1 10.200.1.0/24

  ln -s $(pwd)/secrets/sshkey /home/ndd/.ssh/homelab

  while read IP FQDN HOST SUBNET; do
      CMD="sed -i 's/^127.0.1.1.*/127.0.1.1\t${FQDN} ${HOST}/' /etc/hosts"
      ssh -i secrets/sshkey -n root@${IP} "$CMD"
      ssh -i secrets/sshkey -n root@${IP} hostnamectl set-hostname ${HOST}
      ssh -i secrets/sshkey -n root@${IP} systemctl restart systemd-hostnamed
  done < machines.txt

  # verify
  while read IP FQDN HOST SUBNET; do
      ssh -i secrets/sshkey -n root@${IP} hostname --fqdn
  done < machines.txt
  # output
  server.kubernetes.local
  node-0.kubernetes.local
  node-1.kubernetes.local

#+end_src
Setup ~/etc/hosts~ file
#+begin_src sh
  echo "# Homelab" > hosts
  while read IP FQDN HOST SUBNET; do
      ENTRY="${IP} ${FQDN} ${HOST}"
      echo $ENTRY >> hosts
  done < machines.txt
  # optional
  cat hosts >> /etc/hosts
#+end_src
Verify
#+begin_src sh
  for host in server node-0 node-1
  do ssh -i secrets/sshkey root@${host} hostname
  done
#+end_src
Add host file to remote machines
#+begin_src sh
  while read IP FQDN HOST SUBNET; do
      scp -i secrets/sshkey hosts root@${HOST}:~/
      ssh -i secrets/sshkey -n \
          root@${HOST} "cat hosts >> /etc/hosts && rm hosts"
  done < machines.txt
#+end_src

* Setup Certificate Authority (CA) certificates

Check ~ca.conf~ file and adjust for your setup (remove kube-proxy section)
#+begin_src sh
  mkdir -p secrets/certs
  ln -s $(pwd)/ca.conf $(pwd)/secrets/certs/ca.conf
  openssl genrsa -out secrets/certs/ca.key 4096
  openssl req -x509 -new -sha512 -noenc \
          -key secrets/certs/ca.key -days 3653 \
          -config secrets/certs/ca.conf \
          -out secrets/certs/ca.crt
  # output
  ls -lah secrets/certs
  total 20K
  drwxr-xr-x. 2 ndd ndd 4.0K May  2 18:45 .
  drwxr-xr-x. 3 ndd ndd 4.0K May  2 18:45 ..
  lrwxrwxrwx. 1 ndd ndd   67 May  2 18:45 ca.conf -> /home/ndd/station/k8s-homelab/kubernetes-on-pi-the-hard-way/ca.conf
  -rw-r--r--. 1 ndd ndd 1.9K May  2 18:45 ca.crt
  -rw-------. 1 ndd ndd 3.2K May  2 18:45 ca.key
#+end_src
Create components certificates and private keys
#+begin_src sh
  certs=(
      "admin" "node-0" "node-1"
      "kube-scheduler"
      "kube-controller-manager"
      "kube-api-server"
      "service-accounts"
  )
  CERTDIR=secrets/certs
  for i in ${certs[*]}; do
      openssl genrsa -out "${CERTDIR}/${i}.key" 4096

      openssl req -new -key "${CERTDIR}/${i}.key" -sha256 \
              -config "${CERTDIR}/ca.conf" -section ${i} \
              -out "${CERTDIR}/${i}.csr"

      openssl x509 -req -days 3653 -in "${CERTDIR}/${i}.csr" \
              -copy_extensions copyall \
              -sha256 -CA "${CERTDIR}/ca.crt" \
              -CAkey "${CERTDIR}/ca.key" \
              -CAcreateserial \
              -out "${CERTDIR}/${i}.crt"
  done
#+end_src
Check
#+begin_src sh
  ls -1 secrets/certs
  admin.crt
  admin.csr
  admin.key
  ca.conf
  ca.crt
  ca.key
  ca.srl
  kube-api-server.crt
  kube-api-server.csr
  kube-api-server.key
  kube-controller-manager.crt
  kube-controller-manager.csr
  kube-controller-manager.key
  kube-scheduler.crt
  kube-scheduler.csr
  kube-scheduler.key
  node-0.crt
  node-0.csr
  node-0.key
  node-1.crt
  node-1.csr
  node-1.key
  service-accounts.crt
  service-accounts.csr
  service-accounts.key

#+end_src
** Distribute keys
Worker nodes
#+begin_src sh
  for host in node-0 node-1; do
      ssh -i secrets/sshkey root@${host} mkdir /var/lib/kubelet/

      scp -i secrets/sshkey secrets/certs/ca.crt root@${host}:/var/lib/kubelet/

      scp -i secrets/sshkey secrets/certs/${host}.crt \
          root@${host}:/var/lib/kubelet/kubelet.crt

      scp -i secrets/sshkey secrets/certs/${host}.key \
          root@${host}:/var/lib/kubelet/kubelet.key
  done
#+end_src
Server node
#+begin_src sh
  scp -i secrets/sshkey \
      secrets/certs/ca.key secrets/certs/ca.crt \
      secrets/certs/kube-api-server.key secrets/certs/kube-api-server.crt \
      secrets/certs/service-accounts.key secrets/certs/service-accounts.crt \
      root@server:~/
#+end_src
* Generate ~kubeconfig~ file for authentication
#+begin_src sh
  AUTHDIR="secrets/kubernetes-auth"
  mkdir -p ${AUTHDIR}
#+end_src
*Note*: kube-proxy is skipped
