README.org
** kubelet
#+begin_src sh
  CERTDIR="secrets/certs"
  AUTHDIR="secrets/kubernetes-auth"
  for host in node-0 node-1; do
      kubectl config set-cluster homelab \
              --certificate-authority=${CERTDIR}/ca.crt \
              --embed-certs=true \
              --server=https://server.kubernetes.local:6443 \
              --kubeconfig=${AUTHDIR}/${host}.kubeconfig

      kubectl config set-credentials system:node:${host} \
              --client-certificate=${CERTDIR}/${host}.crt \
              --client-key=${CERTDIR}/${host}.key \
              --embed-certs=true \
              --kubeconfig=${AUTHDIR}/${host}.kubeconfig

      kubectl config set-context default \
              --cluster=homelab \
              --user=system:node:${host} \
              --kubeconfig=${AUTHDIR}/${host}.kubeconfig

      kubectl config use-context default \
              --kubeconfig=${AUTHDIR}/${host}.kubeconfig
  done
#+end_src
** kube-controller-manager
#+begin_src sh
  CERTDIR="secrets/certs"
  AUTHDIR="secrets/kubernetes-auth"
  kubectl config set-cluster homelab \
            --certificate-authority=${CERTDIR}/ca.crt \
            --embed-certs=true \
            --server=https://server.kubernetes.local:6443 \
            --kubeconfig=${AUTHDIR}/kube-controller-manager.kubeconfig

    kubectl config set-credentials system:kube-controller-manager \
            --client-certificate=${CERTDIR}/kube-controller-manager.crt \
            --client-key=${CERTDIR}/kube-controller-manager.key \
            --embed-certs=true \
            --kubeconfig=${AUTHDIR}/kube-controller-manager.kubeconfig

    kubectl config set-context default \
            --cluster=homelab \
            --user=system:kube-controller-manager \
            --kubeconfig=${AUTHDIR}/kube-controller-manager.kubeconfig

    kubectl config use-context default \
            --kubeconfig=${AUTHDIR}/kube-controller-manager.kubeconfig
#+end_src
** kube-scheduler
#+begin_src sh
  CERTDIR="secrets/certs"
  AUTHDIR="secrets/kubernetes-auth"
  kubectl config set-cluster homelab \
            --certificate-authority=${CERTDIR}/ca.crt \
            --embed-certs=true \
            --server=https://server.kubernetes.local:6443 \
            --kubeconfig=${AUTHDIR}/kube-scheduler.kubeconfig

    kubectl config set-credentials system:kube-scheduler \
            --client-certificate=${CERTDIR}/kube-scheduler.crt \
            --client-key=${CERTDIR}/kube-scheduler.key \
            --embed-certs=true \
            --kubeconfig=${AUTHDIR}/kube-scheduler.kubeconfig

    kubectl config set-context default \
            --cluster=homelab \
            --user=system:kube-scheduler \
            --kubeconfig=${AUTHDIR}/kube-scheduler.kubeconfig

    kubectl config use-context default \
            --kubeconfig=${AUTHDIR}/kube-scheduler.kubeconfig
#+end_src
** ~admin~ user
#+begin_src sh
  CERTDIR="secrets/certs"
  AUTHDIR="secrets/kubernetes-auth"
  kubectl config set-cluster homelab \
            --certificate-authority=${CERTDIR}/ca.crt \
            --embed-certs=true \
            --server=https://127.0.0.1:6443 \
            --kubeconfig=${AUTHDIR}/admin.kubeconfig

    kubectl config set-credentials admin \
            --client-certificate=${CERTDIR}/admin.crt \
            --client-key=${CERTDIR}/admin.key \
            --embed-certs=true \
            --kubeconfig=${AUTHDIR}/admin.kubeconfig

    kubectl config set-context default \
            --cluster=homelab \
            --user=admin \
            --kubeconfig=${AUTHDIR}/admin.kubeconfig

    kubectl config use-context default \
            --kubeconfig=${AUTHDIR}/admin.kubeconfig
#+end_src
** Distribute authentication config files
worker nodes
#+begin_src sh
  CERTDIR="secrets/certs"
  AUTHDIR="secrets/kubernetes-auth"
  for host in node-0 node-1; do
      ssh -i secrets/sshkey root@${host} "mkdir -p /var/lib/kubelet"
      scp -i secrets/sshkey ${AUTHDIR}/${host}.kubeconfig \
          root@${host}:/var/lib/kubelet/kubeconfig
  done
#+end_src
server node
#+begin_src sh
  CERTDIR="secrets/certs"
  AUTHDIR="secrets/kubernetes-auth"
  scp -i secrets/sshkey ${AUTHDIR}/admin.kubeconfig \
        ${AUTHDIR}/kube-controller-manager.kubeconfig \
        ${AUTHDIR}/kube-scheduler.kubeconfig \
        root@server:~/
#+end_src
* Generating the Data Encryption Config and Key
Generate random key
#+begin_src sh
  export ENCRYPTION_KEY=$(head -c 32 /dev/urandom | base64)
#+end_src
Replace key
#+begin_src sh
  envsubst < configs-templates/encryption-config.yaml > configs/encryption-config.yaml
#+end_src
Copy config file
#+begin_src sh
  scp -i secrets/sshkey configs/encryption-config.yaml root@server:~/
#+end_src
* Bootstrap etcd cluster
#+begin_src sh
  export ARCH="arm64"
  scp -i secrets/sshkey \
        downloads/${ARCH}/controller/etcd \
        downloads/${ARCH}/client/etcdctl \
        units/etcd.service \
        root@server:~/
#+end_src
Jump to server node
#+begin_src sh
  ssh -i secrets/sshkey root@server
#+end_src
Move binaries
#+begin_src sh
  mv etcd etcdctl /usr/local/bin/
#+end_src
Configuration
#+begin_src sh
  mkdir -p /etc/etcd /var/lib/etcd
  chmod 700 /var/lib/etcd
  cp ca.crt kube-api-server.key kube-api-server.crt \
    /etc/etcd/
#+end_src
~systemd~ service unit file
#+begin_src sh
  mv etcd.service /etc/systemd/system/
#+end_src
Start service
#+begin_src sh
  systemctl daemon-reload
  systemctl enable etcd
  systemctl start etcd
#+end_src
* Bootstrap the Kubernetes Control Plane
** Prerequisites
Copy
#+begin_src sh
  ARCH="arm64"
  scp -i secrets/sshkey \
        downloads/${ARCH}/controller/kube-apiserver \
        downloads/${ARCH}/controller/kube-controller-manager \
        downloads/${ARCH}/controller/kube-scheduler \
        downloads/${ARCH}/client/kubectl \
        units/kube-apiserver.service \
        units/kube-controller-manager.service \
        units/kube-scheduler.service \
        configs/kube-scheduler.yaml \
        configs/kube-apiserver-to-kubelet.yaml \
        root@server:~/
#+end_src
Jump to server
#+begin_src sh
  ssh -i secrets/sshkey root@server
#+end_src
Make config dir
#+begin_src sh
  mkdir -p /etc/kubernetes/config
#+end_src
** Provision Control Plane
*** Kube Controller Binaries
Install binaries
#+begin_src sh
  mv kube-apiserver \
     kube-controller-manager \
     kube-scheduler kubectl \
     /usr/local/bin/
#+end_src
*** Configure API server
#+begin_src sh
  mkdir -p /var/lib/kubernetes/

  mv ca.crt ca.key \
     kube-api-server.key kube-api-server.crt \
     service-accounts.key service-accounts.crt \
     encryption-config.yaml \
     /var/lib/kubernetes/
#+end_src
*** ~kube-apiserver.service~ unit file
#+begin_src sh
  mv kube-apiserver.service \
     /etc/systemd/system/kube-apiserver.service
#+end_src
*** Configure Kubernetes Controller Manager
#+begin_src sh
  mv kube-controller-manager.kubeconfig /var/lib/kubernetes/
  mv kube-controller-manager.service /etc/systemd/system/
#+end_src
*** Configure Kubernetes Scheduler
#+begin_src sh
  mv kube-scheduler.kubeconfig /var/lib/kubernetes/
  mv kube-scheduler.yaml /etc/kubernetes/config/
  mv kube-scheduler.service /etc/systemd/system/
#+end_src
*** Start controller services
Start systemd services
#+begin_src sh
  systemctl daemon-reload

  systemctl enable kube-apiserver \
            kube-controller-manager kube-scheduler

  systemctl start kube-apiserver \
            kube-controller-manager kube-scheduler
#+end_src
Verification 0: systemd service (server node)
#+begin_src sh
  systemctl is-active kube-apiserver
  systemctl is-active kube-controller-manager
  systemctl is-active kube-scheduler
#+end_src
Verification 1: Cluster info dumping (server node)
#+begin_src sh
  kubectl cluster-info \
          --kubeconfig admin.kubeconfig
#+end_src
