first-time/README.md


<a id="org43426b9"></a>

## kubelet

    CERTDIR="secrets/certs"
    AUTHDIR="secrets/kubernetes-auth"
    for host in node-0 node-1; do
        kubectl config set-cluster homelab \
                --certificate-authority=${CERTDIR}/ca.crt \
                --embed-certs=true \
                --server=https://server.kubernetes.local:6443 \
                --kubeconfig=${AUTHDIR}/${host}.kubeconfig
    
        kubectl config set-credentials system:node:${host} \
                --client-certificate=${CERTDIR}/${host}.crt \
                --client-key=${CERTDIR}/${host}.key \
                --embed-certs=true \
                --kubeconfig=${AUTHDIR}/${host}.kubeconfig
    
        kubectl config set-context default \
                --cluster=homelab \
                --user=system:node:${host} \
                --kubeconfig=${AUTHDIR}/${host}.kubeconfig
    
        kubectl config use-context default \
                --kubeconfig=${AUTHDIR}/${host}.kubeconfig
    done


<a id="org3f9f705"></a>

## kube-controller-manager

    CERTDIR="secrets/certs"
    AUTHDIR="secrets/kubernetes-auth"
    kubectl config set-cluster homelab \
              --certificate-authority=${CERTDIR}/ca.crt \
              --embed-certs=true \
              --server=https://server.kubernetes.local:6443 \
              --kubeconfig=${AUTHDIR}/kube-controller-manager.kubeconfig
    
      kubectl config set-credentials system:kube-controller-manager \
              --client-certificate=${CERTDIR}/kube-controller-manager.crt \
              --client-key=${CERTDIR}/kube-controller-manager.key \
              --embed-certs=true \
              --kubeconfig=${AUTHDIR}/kube-controller-manager.kubeconfig
    
      kubectl config set-context default \
              --cluster=homelab \
              --user=system:kube-controller-manager \
              --kubeconfig=${AUTHDIR}/kube-controller-manager.kubeconfig
    
      kubectl config use-context default \
              --kubeconfig=${AUTHDIR}/kube-controller-manager.kubeconfig


<a id="org8736c20"></a>

## kube-scheduler

    CERTDIR="secrets/certs"
    AUTHDIR="secrets/kubernetes-auth"
    kubectl config set-cluster homelab \
              --certificate-authority=${CERTDIR}/ca.crt \
              --embed-certs=true \
              --server=https://server.kubernetes.local:6443 \
              --kubeconfig=${AUTHDIR}/kube-scheduler.kubeconfig
    
      kubectl config set-credentials system:kube-scheduler \
              --client-certificate=${CERTDIR}/kube-scheduler.crt \
              --client-key=${CERTDIR}/kube-scheduler.key \
              --embed-certs=true \
              --kubeconfig=${AUTHDIR}/kube-scheduler.kubeconfig
    
      kubectl config set-context default \
              --cluster=homelab \
              --user=system:kube-scheduler \
              --kubeconfig=${AUTHDIR}/kube-scheduler.kubeconfig
    
      kubectl config use-context default \
              --kubeconfig=${AUTHDIR}/kube-scheduler.kubeconfig


<a id="org6214021"></a>

## `admin` user

    CERTDIR="secrets/certs"
    AUTHDIR="secrets/kubernetes-auth"
    kubectl config set-cluster homelab \
              --certificate-authority=${CERTDIR}/ca.crt \
              --embed-certs=true \
              --server=https://127.0.0.1:6443 \
              --kubeconfig=${AUTHDIR}/admin.kubeconfig
    
      kubectl config set-credentials admin \
              --client-certificate=${CERTDIR}/admin.crt \
              --client-key=${CERTDIR}/admin.key \
              --embed-certs=true \
              --kubeconfig=${AUTHDIR}/admin.kubeconfig
    
      kubectl config set-context default \
              --cluster=homelab \
              --user=admin \
              --kubeconfig=${AUTHDIR}/admin.kubeconfig
    
      kubectl config use-context default \
              --kubeconfig=${AUTHDIR}/admin.kubeconfig


<a id="org664c322"></a>

## Distribute authentication config files

worker nodes

    CERTDIR="secrets/certs"
    AUTHDIR="secrets/kubernetes-auth"
    for host in node-0 node-1; do
        ssh -i secrets/sshkey root@${host} "mkdir -p /var/lib/kubelet"
        scp -i secrets/sshkey ${AUTHDIR}/${host}.kubeconfig \
            root@${host}:/var/lib/kubelet/kubeconfig
    done

server node

    CERTDIR="secrets/certs"
    AUTHDIR="secrets/kubernetes-auth"
    scp -i secrets/sshkey ${AUTHDIR}/admin.kubeconfig \
          ${AUTHDIR}/kube-controller-manager.kubeconfig \
          ${AUTHDIR}/kube-scheduler.kubeconfig \
          root@server:~/


<a id="org765144d"></a>

# Generating the Data Encryption Config and Key

Generate random key

    export ENCRYPTION_KEY=$(head -c 32 /dev/urandom | base64)

Replace key

    envsubst < configs-templates/encryption-config.yaml > configs/encryption-config.yaml

Copy config file

    scp -i secrets/sshkey configs/encryption-config.yaml root@server:~/


<a id="org3067510"></a>

# Bootstrap etcd cluster

    export ARCH="arm64"
    scp -i secrets/sshkey \
          downloads/${ARCH}/controller/etcd \
          downloads/${ARCH}/client/etcdctl \
          units/etcd.service \
          root@server:~/

Jump to server node

    ssh -i secrets/sshkey root@server

Move binaries

    mv etcd etcdctl /usr/local/bin/

Configuration

    mkdir -p /etc/etcd /var/lib/etcd
    chmod 700 /var/lib/etcd
    cp ca.crt kube-api-server.key kube-api-server.crt \
      /etc/etcd/

`systemd` service unit file

    mv etcd.service /etc/systemd/system/

Start service

    systemctl daemon-reload
    systemctl enable etcd
    systemctl start etcd


<a id="orga500a3e"></a>

# Bootstrap the Kubernetes Control Plane


<a id="orgb79ac8f"></a>

## Prerequisites

Copy

    ARCH="arm64"
    scp -i secrets/sshkey \
          downloads/${ARCH}/controller/kube-apiserver \
          downloads/${ARCH}/controller/kube-controller-manager \
          downloads/${ARCH}/controller/kube-scheduler \
          downloads/${ARCH}/client/kubectl \
          units/kube-apiserver.service \
          units/kube-controller-manager.service \
          units/kube-scheduler.service \
          configs/kube-scheduler.yaml \
          configs/kube-apiserver-to-kubelet.yaml \
          root@server:~/

Jump to server

    ssh -i secrets/sshkey root@server

Make config dir

    mkdir -p /etc/kubernetes/config


<a id="orgc137b2b"></a>

## Provision Control Plane


<a id="orgba9bfd6"></a>

### Kube Controller Binaries

Install binaries

    mv kube-apiserver \
       kube-controller-manager \
       kube-scheduler kubectl \
       /usr/local/bin/


<a id="org2caa98e"></a>

### Configure API server

    mkdir -p /var/lib/kubernetes/
    
    mv ca.crt ca.key \
       kube-api-server.key kube-api-server.crt \
       service-accounts.key service-accounts.crt \
       encryption-config.yaml \
       /var/lib/kubernetes/


<a id="orgf475d59"></a>

### `kube-apiserver.service` unit file

    mv kube-apiserver.service \
       /etc/systemd/system/kube-apiserver.service


<a id="orgbb95406"></a>

### Configure Kubernetes Controller Manager

    mv kube-controller-manager.kubeconfig /var/lib/kubernetes/
    mv kube-controller-manager.service /etc/systemd/system/


<a id="org31e0889"></a>

### Configure Kubernetes Scheduler

    mv kube-scheduler.kubeconfig /var/lib/kubernetes/
    mv kube-scheduler.yaml /etc/kubernetes/config/
    mv kube-scheduler.service /etc/systemd/system/


<a id="org83b80b2"></a>

### Start controller services

Start systemd services

    systemctl daemon-reload
    
    systemctl enable kube-apiserver \
              kube-controller-manager kube-scheduler
    
    systemctl start kube-apiserver \
              kube-controller-manager kube-scheduler

Verification 0: systemd service (server node)

    systemctl is-active kube-apiserver
    systemctl is-active kube-controller-manager
    systemctl is-active kube-scheduler

Verification 1: Cluster info dumping (server node)

    kubectl cluster-info \
            --kubeconfig admin.kubeconfig
