README.org
** RBAC for kubelet authorization
This is operation on server node
#+begin_src sh
  ssh root@server
#+end_src
Apply using kubectl and ~admin.kubeconfig~ authentication file
#+begin_src sh
  kubectl apply -f kube-apiserver-to-kubelet.yaml \
          --kubeconfig admin.kubeconfig
#+end_src
** Verification from the operation machine
#+begin_src sh
  curl --cacert secrets/certs/ca.crt \
       https://server.kubernetes.local:6443/version
  # output
  {
      "major": "1",
      "minor": "33",
      "emulationMajor": "1",
      "emulationMinor": "33",
      "minCompatibilityMajor": "1",
      "minCompatibilityMinor": "32",
      "gitVersion": "v1.33.0",
      "gitCommit": "60a317eadfcb839692a68eab88b2096f4d708f4f",
      "gitTreeState": "clean",
      "buildDate": "2025-04-23T13:00:14Z",
      "goVersion": "go1.24.2",
      "compiler": "gc",
      "platform": "linux/arm64"
  }
#+end_src
* Bootstrap Worker Nodes

** Prerequisites
Copy files
#+begin_src sh
  for HOST in node-0 node-1; do
      scp -i secrets/sshkey configs/kubelet-config.yaml root@${HOST}:~/
  done
#+end_src
#+begin_src sh
  ARCH="arm64"
  for HOST in node-0 node-1; do
      scp -i secrets/sshkey \
          downloads/${ARCH}/worker/* \
          downloads/${ARCH}/client/kubectl \
          configs/99-loopback.conf \
          configs/containerd-config.toml \
          units/containerd.service \
          units/kubelet.service \
          root@${HOST}:~/
  done
#+end_src
#+begin_src sh
  ARCH="arm64"
  for HOST in node-0 node-1; do
      scp -i secrets/sshkey \
          downloads/${ARCH}/cni-plugins/* \
          root@${HOST}:~/cni-plugins/
  done
#+end_src
** Setup on each node
Jump
#+begin_src sh
  HOST="node-0"
  ssh -i secrets/sshkey root@$HOST
#+end_src
Install modules
#+begin_src sh
  apt-get update
  apt-get -y install socat conntrack ipset kmod
#+end_src
Disable swap for good (hard to allocate memory when swap is involved). Reference: https://serverfault.com/questions/1093773/how-to-permanently-remove-dev-zram0-as-swap-in-armbian
#+begin_src sh
  sed -i 's/# SWAP=false/SWAP=false/g' /etc/default/armbian-zram-config
  reboot
  # verification
  swapon --show
#+end_src
Installation directories
#+begin_src sh
  mkdir -p \
        /etc/cni/net.d \
        /opt/cni/bin \
        /var/lib/kubelet \
        /var/lib/kubernetes \
        /var/run/kubernetes
#+end_src
Worker binaries
#+begin_src sh
  mv crictl kubelet runc \
     /usr/local/bin/
  mv containerd containerd-shim-runc-v2 containerd-stress /bin/
  mv cni-plugins/* /opt/cni/bin/
#+end_src
** Configure CNI networking
Copy configuration files
#+begin_src sh
  mv 99-loopback.conf /etc/cni/net.d/
#+end_src
Load and configure ~br-netfilter~ kernel module
#+begin_src sh
  modprobe br-netfilter
  echo "br-netfilter" >> /etc/modules-load.d/modules.conf

  echo "net.bridge.bridge-nf-call-iptables = 1" \
       >> /etc/sysctl.d/kubernetes.conf
  echo "net.bridge.bridge-nf-call-ip6tables = 1" \
       >> /etc/sysctl.d/kubernetes.conf
  sysctl -p /etc/sysctl.d/kubernetes.conf
#+end_src
** Configure ~containerd~
#+begin_src sh
  mkdir -p /etc/containerd/
  mv containerd-config.toml /etc/containerd/config.toml
  mv containerd.service /etc/systemd/system/
#+end_src
** Configure ~kubelet~
#+begin_src sh
  mv kubelet-config.yaml /var/lib/kubelet/kubelet-config.yaml
  mv kubelet.service /etc/systemd/system/
#+end_src
** Start services
#+begin_src sh
  systemctl daemon-reload
  systemctl enable containerd kubelet
  systemctl start containerd kubelet
#+end_src
Setup for jumpbox's remote control (to install Cillium)
#+begin_src sh
  kubectl config set-cluster homelab \
          --certificate-authority=secrets/certs/ca.crt \
          --embed-certs=true \
          --server=https://server.kubernetes.local:6443

  kubectl config set-credentials admin \
          --client-certificate=secrets/certs/admin.crt \
          --client-key=secrets/certs/admin.key

  kubectl config set-context homelab \
          --cluster=homelab \
          --user=admin

  kubectl config use-context homelab
#+end_src
* Setup Cillium to fully replace kube-proxy
Reference: [[https://docs.cilium.io/en/stable/network/kubernetes/kubeproxy-free/][Kubernetes without kube-proxy]]

#+begin_src sh
  API_SERVER_IP=server.kubernetes.local
  API_SERVER_PORT=6443
  helm install cilium cilium/cilium --version 1.17.3 \
       --namespace kube-system \
       --set kubeProxyReplacement=true \
       --set k8sServiceHost=${API_SERVER_IP} \
       --set k8sServicePort=${API_SERVER_PORT}
#+end_src
Check IP ranges for each node
#+begin_src sh
  kubectl get ciliumnode -o jsonpath='{range .items[*]}{.metadata.name} {.spec.ipam.podCIDRs[]}{"\n"}{end}' | column -t
  # output
  node-0  10.0.0.0/24
  node-1  10.0.1.0/24
#+end_src
* Smoke test
Encryption secret
#+begin_src sh
  kubectl create secret generic kubernetes-the-hard-way \
          --from-literal="mykey=mydata"

  ssh -i secrets/sshkey root@server \
      'etcdctl get /registry/secrets/default/kubernetes-the-hard-way | hexdump -C'
#+end_src
Deployment
#+begin_src sh
  # create deployment
  kubectl create deployment nginx --image=nginx:latest
  # get pod
  kubectl get pods -l app=nginx
  
#+end_src
Forwarding port
#+begin_src sh
  POD_NAME=$(kubectl get pods -l app=nginx \
                     -o jsonpath="{.items[0].metadata.name}")
  kubectl port-forward $POD_NAME 8080:80
  curl --head http://127.0.0.1:8080
  kubectl logs $POD_NAME
  kubectl exec -ti $POD_NAME -- nginx -v
#+end_src
Service
#+begin_src sh
  kubectl expose deployment nginx \
          --port 80 --type NodePort
  # get port
  NODE_PORT=$(kubectl get svc nginx \
                      --output=jsonpath='{range .spec.ports[0]}{.nodePort}')
  NODE_NAME=$(kubectl get pods \
                      -l app=nginx \
                      -o jsonpath="{.items[0].spec.nodeName}")
  # make call to the service
  curl -I http://${NODE_NAME}:${NODE_PORT}

  HTTP/1.1 200 OK
  Server: nginx/1.27.5
  Date: Sun, 04 May 2025 14:11:36 GMT
  Content-Type: text/html
  Content-Length: 615
  Last-Modified: Wed, 16 Apr 2025 12:01:11 GMT
  Connection: keep-alive
  ETag: "67ff9c07-267"
  Accept-Ranges: bytes
#+end_src
