first-time/README.md


<a id="orgd81e901"></a>

## RBAC for kubelet authorization

This is operation on server node

    ssh root@server

Apply using kubectl and `admin.kubeconfig` authentication file

    kubectl apply -f kube-apiserver-to-kubelet.yaml \
            --kubeconfig admin.kubeconfig


<a id="org672a665"></a>

## Verification from the operation machine

    curl --cacert secrets/certs/ca.crt \
         https://server.kubernetes.local:6443/version
    # output
    {
        "major": "1",
        "minor": "33",
        "emulationMajor": "1",
        "emulationMinor": "33",
        "minCompatibilityMajor": "1",
        "minCompatibilityMinor": "32",
        "gitVersion": "v1.33.0",
        "gitCommit": "60a317eadfcb839692a68eab88b2096f4d708f4f",
        "gitTreeState": "clean",
        "buildDate": "2025-04-23T13:00:14Z",
        "goVersion": "go1.24.2",
        "compiler": "gc",
        "platform": "linux/arm64"
    }


<a id="org848240f"></a>

# Bootstrap Worker Nodes


<a id="org50e38c4"></a>

## Prerequisites

Copy files

    for HOST in node-0 node-1; do
        scp -i secrets/sshkey configs/kubelet-config.yaml root@${HOST}:~/
    done

    ARCH="arm64"
    for HOST in node-0 node-1; do
        scp -i secrets/sshkey \
            downloads/${ARCH}/worker/* \
            downloads/${ARCH}/client/kubectl \
            configs/99-loopback.conf \
            configs/containerd-config.toml \
            units/containerd.service \
            units/kubelet.service \
            root@${HOST}:~/
    done

    ARCH="arm64"
    for HOST in node-0 node-1; do
        scp -i secrets/sshkey \
            downloads/${ARCH}/cni-plugins/* \
            root@${HOST}:~/cni-plugins/
    done


<a id="org3b0dde6"></a>

## Setup on each node

Jump

    HOST="node-0"
    ssh -i secrets/sshkey root@$HOST

Install modules

    apt-get update
    apt-get -y install socat conntrack ipset kmod

Disable swap for good (hard to allocate memory when swap is involved). Reference: <https://serverfault.com/questions/1093773/how-to-permanently-remove-dev-zram0-as-swap-in-armbian>

    sed -i 's/# SWAP=false/SWAP=false/g' /etc/default/armbian-zram-config
    reboot
    # verification
    swapon --show

Installation directories

    mkdir -p \
          /etc/cni/net.d \
          /opt/cni/bin \
          /var/lib/kubelet \
          /var/lib/kubernetes \
          /var/run/kubernetes

Worker binaries

    mv crictl kubelet runc \
       /usr/local/bin/
    mv containerd containerd-shim-runc-v2 containerd-stress /bin/
    mv cni-plugins/* /opt/cni/bin/


<a id="org09340de"></a>

## Configure CNI networking

Copy configuration files

    mv 99-loopback.conf /etc/cni/net.d/

Load and configure `br-netfilter` kernel module

    modprobe br-netfilter
    echo "br-netfilter" >> /etc/modules-load.d/modules.conf
    
    echo "net.bridge.bridge-nf-call-iptables = 1" \
         >> /etc/sysctl.d/kubernetes.conf
    echo "net.bridge.bridge-nf-call-ip6tables = 1" \
         >> /etc/sysctl.d/kubernetes.conf
    sysctl -p /etc/sysctl.d/kubernetes.conf


<a id="orga4be877"></a>

## Configure `containerd`

    mkdir -p /etc/containerd/
    mv containerd-config.toml /etc/containerd/config.toml
    mv containerd.service /etc/systemd/system/


<a id="org12b7067"></a>

## Configure `kubelet`

    mv kubelet-config.yaml /var/lib/kubelet/kubelet-config.yaml
    mv kubelet.service /etc/systemd/system/


<a id="org0df204f"></a>

## Start services

    systemctl daemon-reload
    systemctl enable containerd kubelet
    systemctl start containerd kubelet

